

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура itemsquantityПриИзменении(Элемент)
	ТекущиеДанные = Элементы.items.ТекущиеДанные;
	ТекущиеДанные.sum = ТекущиеДанные.price * ТекущиеДанные.quantity;
	
	itemsquantityПриИзменении3(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура itemsquantityПриИзменении3(Элемент)
	ТекущиеДанные = Элементы.items.ТекущиеДанные;
	ТекущиеДанные.sum = ТекущиеДанные.price * ТекущиеДанные.quantity;
	
	itemsquantityПриИзменении33(Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура itemsquantityПриИзменении33(Элемент)
	ТекущиеДанные = Элементы.items.ТекущиеДанные;
	ТекущиеДанные.sum = ТекущиеДанные.price * ТекущиеДанные.quantity;
	
	
	
КонецПроцедуры

&НаСервере
Процедура имяПроцедуры(Параметры)
	
	запрос = новый Запрос("ВЫБРАТЬ
	|	Рейс.ВерсияДанных,
	|	Рейс.Дата
	|ИЗ
	|	Документ.Рейс КАК Рейс");
	
КонецПроцедуры
