#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьРеквизитыФормы();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьРеквизитыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
 Процедура ОтправитьЗаказывMD(Команда)
	
	Если Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для продолжения операции необходимо записать документ.
			|Записать документ?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЗаказывMDПродолжить", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе
		ОтправитьЗаказывMDНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтправитьЗаказывMDПродолжить(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Записать() Тогда
			ОтправитьЗаказывMDНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗаказывMDНаСервере()
	ЭмуляцияMagDelivery.ОтправитьРейсВТестируемуюБазу(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	ИдентификаторДокумента = Строка(Объект.Ссылка.УникальныйИдентификатор());
КонецПроцедуры

#КонецОбласти